Revit 2024 API
BuiltInFailures.CurveFailures.CurveNotEditable Property
 Lines created by massing or picking 3d path are not editable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CurveNotEditable { get; }
Visual Basic
Public Shared ReadOnly Property CurveNotEditable As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CurveNotEditable {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace